kyungjae-lee/stm32-mcu-custom-bootloader/workspace/stm32f407xx_bootloader/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

#include <stdarg.h>
#include <string.h>
#include <stdio.h>	/* vsprintf */

#include "main.h"
#include "stm32f4xx_hal.h"

/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

#define BL_DEBUG_MSG_EN
#define D_UART					&huart3		/* Debug USART */
#define C_UART					&huart2		/* Virtual COM Port USART */
#define BL_RX_LEN				200

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
CRC_HandleTypeDef hcrc;

UART_HandleTypeDef huart2;
UART_HandleTypeDef huart3;

/* USER CODE BEGIN PV */

char data[] = "Message from bootloader\r\n";
uint8_t blRxBuffer[BL_RX_LEN];

uint8_t supportedCmds[] = {
	BL_GET_VER,
	BL_GET_HELP,
	BL_GET_CID,
	BL_GET_RDP_STATUS,
	BL_GO_TO_ADDR,
	BL_ERASE_FLASH,
	BL_WRITE_MEM,
	BL_READ_PROTECT_STATUS
};
	

/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_CRC_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_USART3_UART_Init(void);
/* USER CODE BEGIN PFP */

static void Print_Msg(char *format, ...);

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */


/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_CRC_Init();
  MX_USART2_UART_Init();
  MX_USART3_UART_Init();
  /* USER CODE BEGIN 2 */
	
	if (HAL_GPIO_ReadPin(B1_GPIO_Port, B1_Pin) == GPIO_PIN_SET)
	{
		Print_Msg("BL_DEBUG_MSG: Button pressed ... going to BL mode\n\r");
		
		/* Continue in the bootloader mode */
		Bootloader_UART_Read_Data();
	}
	else
	{
		Print_Msg("BL_DEBUG_MSG:: Button not pressed ... executing user application\n\r");
		Bootloader_Jump_To_User_App();
	}

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */
  while (1)
  {
    /* USER CODE END WHILE */

    /* USER CODE BEGIN 3 */
  }
  /* USER CODE END 3 */
}

void Bootloader_UART_Read_Data(void)
{
	uint8_t rcvLen = 0;
	
	while (1)
	{
		memset(blRxBuffer, 0, 200);
		
		/* Read and decode the command coming from the host */
		
		/* First, read the first byte (i.e., the "Length to follow" field ) */
		HAL_UART_Receive(C_UART, blRxBuffer, 1, HAL_MAX_DELAY);
		rcvLen = blRxBuffer[0];	/* Number of the remaining bytes to read */
		
		/* Second, read the remaining bytes, first of which is the "Command code" */
		HAL_UART_Receive(C_UART, &blRxBuffer[1], rcvLen, HAL_MAX_DELAY);
		
		/* Decode the command code */
		switch (blRxBuffer[1])
		{
			case BL_GET_VER:
				Bootloader_GetVer_Cmd_Handler(blRxBuffer);
				break;
			case BL_GET_HELP:
				Bootloader_GetHelp_Cmd_Handler(blRxBuffer);
				break;
			case BL_GET_CID:
				Bootloader_GetCID_Cmd_Handler(blRxBuffer);
				break;
			case BL_GET_RDP_STATUS:
				Bootloader_GetRDP_Cmd_Handler(blRxBuffer);
				break;
			case BL_GO_TO_ADDR:
				Bootloader_GoToAddr_Cmd_Handler(blRxBuffer);
				break;
			case BL_ERASE_FLASH:
				Bootloader_EraseFlash_Cmd_Handler(blRxBuffer);
				break;
			case BL_WRITE_MEM:
				Bootloader_WriteMem_Cmd_Handler(blRxBuffer);
				break;
			case BL_ENDIS_RW_PROTECT:
				Bootloader_EnDisRWProtect_Cmd_Handler(blRxBuffer);
				break;
			case BL_READ_MEM:
				Bootloader_ReadMem_Cmd_Handler(blRxBuffer);
				break;
			case BL_READ_PROTECT_STATUS:
				Bootloader_ReadProtectStatus_Cmd_Handler(blRxBuffer);
				break;
			case BL_READ_OTP:
				Bootloader_ReadOTP_Cmd_Handler(blRxBuffer);
				break;
			default:
				Print_Msg("BL_DEBUG_MSG: Invalid command code received from the host\n");
				break;
		}
	}
}

/* Jump to the user application.
 * Here, we are assuming that the FLASH_SECTOR2_BASE_ADDRESS is where the user
 * application is stored
 * Note: Make sure to uncomment 'USER_VECT_TAB_ADDRESS' macro in the 
 *       system_stm32f4xx.c file since we are relocating the vector table.
 */
void Bootloader_Jump_To_User_App(void)
{
	/* Function pointer to hold the address ofthe reset handler of the user app */
	void (*appResetHandler)(void);
	
	Print_Msg("BL_DEBUG_MSG: Bootloader_Jump_To_User_App()\n");
	
	/* 1. Configure the MSP by reading the value from the base address of the sector 2.
	 *    The very first element of the vector table holds the initial value of the msp.
	 */
	uint32_t msp = *(volatile uint32_t *)FLASH_SECTOR2_BASE_ADDRESS;
	Print_Msg("BL_DEBUG_MSG: MSP: %#x\n", msp);
	
