kyungjae-lee/stm32-mcu-custom-bootloader/workspace/stm32f407xx_bootloader/Core/Src/main.c
  /*Configure GPIO pin : I2S3_WS_Pin */
  GPIO_InitStruct.Pin = I2S3_WS_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF6_SPI3;
  HAL_GPIO_Init(I2S3_WS_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : SPI1_SCK_Pin SPI1_MISO_Pin SPI1_MOSI_Pin */
  GPIO_InitStruct.Pin = SPI1_SCK_Pin|SPI1_MISO_Pin|SPI1_MOSI_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF5_SPI1;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pin : BOOT1_Pin */
  GPIO_InitStruct.Pin = BOOT1_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(BOOT1_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : CLK_IN_Pin */
  GPIO_InitStruct.Pin = CLK_IN_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF5_SPI2;
  HAL_GPIO_Init(CLK_IN_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : LD4_Pin LD3_Pin LD5_Pin LD6_Pin
                           Audio_RST_Pin */
  GPIO_InitStruct.Pin = LD4_Pin|LD3_Pin|LD5_Pin|LD6_Pin
                          |Audio_RST_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOD, &GPIO_InitStruct);

  /*Configure GPIO pins : I2S3_MCK_Pin I2S3_SD_Pin */
  GPIO_InitStruct.Pin = I2S3_MCK_Pin|I2S3_SD_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF6_SPI3;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pin : VBUS_FS_Pin */
  GPIO_InitStruct.Pin = VBUS_FS_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(VBUS_FS_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : OTG_FS_ID_Pin OTG_FS_DM_Pin OTG_FS_DP_Pin */
  GPIO_InitStruct.Pin = OTG_FS_ID_Pin|OTG_FS_DM_Pin|OTG_FS_DP_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_FS;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

  /*Configure GPIO pin : OTG_FS_OverCurrent_Pin */
  GPIO_InitStruct.Pin = OTG_FS_OverCurrent_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(OTG_FS_OverCurrent_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : Audio_SCL_Pin Audio_SDA_Pin */
  GPIO_InitStruct.Pin = Audio_SCL_Pin|Audio_SDA_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_OD;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  GPIO_InitStruct.Alternate = GPIO_AF4_I2C1;
  HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

  /*Configure GPIO pin : MEMS_INT2_Pin */
  GPIO_InitStruct.Pin = MEMS_INT2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_EVT_RISING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(MEMS_INT2_GPIO_Port, &GPIO_InitStruct);

/* USER CODE BEGIN MX_GPIO_Init_2 */
/* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */

/* Implementation of the bootloader command handler functions */

/**
 * @brief	Handles BL_GET_VER command
 * @param	pBLRxBuffer - Pointer to the bootloader's Rx buffer
 * @retval	None
 * @note	BL_GET_VER command is used to read the bootloader version from the 
 *  		MCU.
 */
void Bootloader_GetVer_Cmd_Handler(uint8_t *pBLRxBuffer)
{
	uint8_t blVersion;
	
	Print_Msg("BL_DEBUG_MSG: bootloader_getver_cmd_handler()\n");
	
	/* Total length of the command packet */
	uint32_t cmdPacketLen = pBLRxBuffer[0] + 1;
	
	/* Extract the CRC32 sent by the host */
	uint32_t crcHost = *((uint32_t *)(pBLRxBuffer + cmdPacketLen - 4));
	
	if (!Bootloader_Verify_CRC(&pBLRxBuffer[0], cmdPacketLen - 4, crcHost))
	{
		/* Checksum is correct */
		Print_Msg("BL_DEBUG_MSG: Checksum verification success!\n");
		
		/* Send ACK */
		Bootloader_Tx_ACK(pBLRxBuffer[0], 1);
		blVersion = Get_Bootloader_Version();
		Print_Msg("BL_DEBUG_MSG: BL_VER: %d %#x\n", blVersion, blVersion);
		
		/* Send response to the host */
		Bootloader_UART_Write_Data(&blVersion, 1);
	}
	else
	{
		/* Checksum is not correct */
		Print_Msg("BL_DEBUG_MSG: Checksum vrification fail!\n");
		
		/* Send NACK */
		Bootloader_Tx_NACK();
	}
}

/**
 * @brief	Handles BL_GET_HELP command
 * @param	pBLRxBuffer - Pointer to the bootloader's Rx buffer
 * @retval	None
 * @note	BL_GET_HELP command is used to retrieve all the commands that are 
 * 			supported by the bootloader.
 */
void Bootloader_GetHelp_Cmd_Handler(uint8_t *pBLRxBuffer)
{
	Print_Msg("BL_DEBUG_MSG: Bootloader_GetHelp_Cmd_Handler()\n");
	
	/* Total length of the command packet */
	uint32_t cmdPacketLen = pBLRxBuffer[0] + 1;
	
	/* Extract the CRC32 sent by the host */
	uint32_t crcHost = *((uint32_t *)(pBLRxBuffer + cmdPacketLen - 4));

	if (!Bootloader_Verify_CRC(&pBLRxBuffer[0], cmdPacketLen - 4, crcHost))
	{
		/* Checksum is correct */
		Print_Msg("BL_DEBUG_MSG: Checksum verification success!\n");
		
		/* Send ACK */
		Bootloader_Tx_ACK(pBLRxBuffer[0], sizeof(supportedCmds));
		
		/* Send response to the host */
		Bootloader_UART_Write_Data(supportedCmds, sizeof(supportedCmds));
	}
	else
	{
		/* Checksum is not correct */
		Print_Msg("BL_DEBUG_MSG: Checksum vrification fail!\n");
		
		/* Send NACK */
		Bootloader_Tx_NACK();
	}
}

/**
 * @brief	Handles BL_GET_CID command
 * @param	pBLRxBuffer - Pointer to the bootloader's Rx buffer
 * @retval	None
 * @note	BL_GET_CID command is used to read the MCU chip identification
 *			number.
 *			This function can be updated to read the Revision Identifier
 *			(REV_ID) as well.
 */
void Bootloader_GetCID_Cmd_Handler(uint8_t *pBLRxBuffer)
{
	Print_Msg("BL_DEBUG_MSG: Bootloader_GetCID_Cmd_Handler()\n");
	
	uint16_t cid;

	/* Total length of the command packet */
	uint32_t cmdPacketLen = pBLRxBuffer[0] + 1;
	
	/* Extract the CRC32 sent by the host */
	uint32_t crcHost = *((uint32_t *)(pBLRxBuffer + cmdPacketLen - 4));

	if (!Bootloader_Verify_CRC(&pBLRxBuffer[0], cmdPacketLen - 4, crcHost))
	{
		/* Checksum is correct */
		Print_Msg("BL_DEBUG_MSG: Checksum verification success!\n");
		
		/* Send ACK */
		Bootloader_Tx_ACK(pBLRxBuffer[0], 2);
		
		cid = Get_MCU_Chip_ID();
		Print_Msg("BL_DEBUG_MSG: MCU Chip ID: %d %#x\n", cid, cid);
		
		/* Send response to the host */
		Bootloader_UART_Write_Data((uint8_t *)&cid, 2);
	}
	else
	{
		/* Checksum is not correct */
		Print_Msg("BL_DEBUG_MSG: Checksum vrification fail!\n");
		
