kyungjae-lee/stm32-mcu-custom-bootloader/workspace/stm32f407xx_bootloader/Core/Src/main.c
		/* Send NACK */
		Bootloader_Tx_NACK();
	}
}

/**
 * @brief	Handles BL_GET_RDP command
 * @param	pBLRxBuffer - Pointer to the bootloader's Rx buffer
 * @retval	None
 * @note	BL_GET_RDP command is used to read the Flash Protection (RDP)
 *			Level.
 */
void Bootloader_GetRDP_Cmd_Handler(uint8_t *pBLRxBuffer)
{
}

/**
 * @brief	Handles BL_GO_TO_ADDR command
 * @param	pBLRxBuffer - Pointer to the bootloader's Rx buffer
 * @retval	None
 * @note	BL_GO_TO_ADDR command is used to jump bootloader to specified 
 *			address.
 */
void Bootloader_GoToAddr_Cmd_Handler(uint8_t *pBLRxBuffer)
{
}

/**
 * @brief	Handles BL_ERASE_FLASH command
 * @param	pBLRxBuffer - Pointer to the bootloader's Rx buffer
 * @retval	None
 * @note	BL_ERASE_FLASH command is used to mass erase or sector erase the user 
 *			Flash.
 */
void Bootloader_EraseFlash_Cmd_Handler(uint8_t *pBLRxBuffer)
{
}

/**
 * @brief	Handles BL_WRITE_MEM command
 * @param	pBLRxBuffer - Pointer to the bootloader's Rx buffer
 * @retval	None
 * @note	BL_WRITE_MEM command is used to write data into different memories of
 * 			the MCU.
 */
void Bootloader_WriteMem_Cmd_Handler(uint8_t *pBLRxBuffer)
{
}

/**
 * @brief	Handles BL_ENDIS_RW_PROTECT command
 * @param	pBLRxBuffer - Pointer to the bootloader's Rx buffer
 * @retval	None
 * @note	BL_ENDIS_RW_PROTECT command is used to enable read/write protection on
 *			different sectors of the user Flash.
 */
void Bootloader_EnDisRWProtect_Cmd_Handler(uint8_t *pBLRxBuffer)
{
}

/**
 * @brief	Handles BL_READ_MEM command
 * @param	pBLRxBuffer - Pointer to the bootloader's Rx buffer
 * @retval	None
 * @note	BL_WRITE_MEM command is used to read data from different memories of
 * 			the MCU.
 */
void Bootloader_ReadMem_Cmd_Handler(uint8_t *pBLRxBuffer)
{
}

/**
 * @brief	Handles BL_READ_PROTECT_STATUS command
 * @param	pBLRxBuffer - Pointer to the bootloader's Rx buffer
 * @retval	None
 * @note	BL_READ_PROTECT_STATUS command is used to read the protection status
 *			of all the sectors of the user Flash memory.
 */
void Bootloader_ReadProtectStatus_Cmd_Handler(uint8_t *pBLRxBuffer)
{
}

/**
 * @brief	Handles BL_READ_OTP command
 * @param	pBLRxBuffer - Pointer to the bootloader's Rx buffer
 * @retval	None
 * @note	BL_READ_OTP command is used to read the OTP contents
 */
void Bootloader_ReadOTP_Cmd_Handler(uint8_t *pBLRxBuffer)
{
}


/* Implementation of the bootloader helper functions */

/**
 * @brief	Sends ACK message to the host
 * @param	cmdCode - Command code received from the host
 * @param	lenToFollow - Length of the subsequent data bytes
 * @retval	None
 */
void Bootloader_Tx_ACK(uint8_t cmdCode, uint8_t lenToFollow)
{
	/* ACKing incorporates 2 bytes; ACK , length to follow */
	uint8_t ackBuf[2];
	ackBuf[0] = BL_ACK;
	ackBuf[1] = lenToFollow;
	HAL_UART_Transmit(C_UART, ackBuf, 2, HAL_MAX_DELAY);
}

/**
 * @brief	Sends NACK message to the host
 * @param	None
 * @retval	None
 */
void Bootloader_Tx_NACK(void)
{
	/* NACKing incorporates 1 byte */
	uint8_t nack = BL_NACK;
	HAL_UART_Transmit(C_UART, &nack, 1, HAL_MAX_DELAY);
}

/**
 * @brief	Verifies the CRC of the given buffer in data 
 * @param	data - Pointer to the data for which the CRC has to be calculated
 * @param	len - Length for which the CRC has to be calculated
 * @param	crc_host - 32-bit crc value sent by the host
 * @retval	0 if CRC verification was successful, 1 otherwise.
 */
uint8_t Bootloader_Verify_CRC(uint8_t *pPacket, uint32_t len, uint32_t crcHost)
{
	uint32_t crc = 0xFF;
	
	for (uint32_t i = 0; i < len; i++)
	{
		uint32_t dataByte = pPacket[i];
		crc = HAL_CRC_Accumulate(&hcrc, &dataByte, 1);
	}
	/* Reset CRC Calculation unit.
	 * Without this, all CRC checks following the very first wone will fail.
	 */
	__HAL_CRC_DR_RESET(&hcrc);
		
	if (crc == crcHost)
	{
		return CRC_VERIFICATION_SUCCESS;
	}
	
	return CRC_VERIFICATION_FAIL;
}

/**
 * @brief	Writes data to C_UART
 * @param	None
 * @retval	Bootloader version macro value
 * @note	This function is a wrapper function for 'HAL_UART_Transmit()'
 */
void Bootloader_UART_Write_Data(uint8_t *pBuffer, uint32_t len)
{
	HAL_UART_Transmit(C_UART, pBuffer, len, HAL_MAX_DELAY);
}

/**
 * @brief	Returns the bootloader version macro value
 * @param	None
 * @retval	Bootloader version macro value
 * @note	N/A
 */
uint8_t Get_Bootloader_Version(void)
{
	return (uint8_t)BL_VERSION;
}

/**
 * @brief	Returns the chip (or device) identifier
 * @param	None
 * @retval	16-bit MCU chip identification number
 * @note	For more information, see the "MCU device ID code" section of the
 *			MCU reference manual. (DBGMCU_IDCODE; Address: 0xE0042000)
 *			- Bit[31:16] - Revision identifier (REV_ID)
 *			- Bit[11:0] - Device identifier (DEV_ID) - 0x413
 */
uint16_t Get_MCU_Chip_ID(void)
{
	return (uint16_t)(DBGMCU->IDCODE) & 0x0FFF;
}

/* USER CODE END 4 */

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
